glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
// ============================================================================
// ra4m1_commands.c — RA4M1 workbench (mode 1) app-shell command table.
//
// Step 4: the analytical-HIL command set. Mirrors the SAMD21 chip command IDs
// 1:1 (0x0100..0x010E) so dongle_console.lua stays uniform across chips, plus
// CMD_SET_MODE / CMD_GET_MODE for the multi-mode foundation. Every handler is
// a thin wrapper over ra4m1_hal — the drivers are shared with the future
// mode 2-4 ISRs.
//
// shell_find_cmd() searches the general table (CMD_ECHO / CMD_SYSINFO) first,
// then falls through to chip_commands_table() exported here.
//
// Differences from samd21_commands.c (the RA4M1 is the higher-res HIL chip):
//   * DAC is 12-bit (0..4095), ADC is 14-bit (0..16383).
//   * The counter slot is a real x4 quadrature decoder (GPT1), not a
//     unidirectional pulse counter — COUNTER_READ returns signed position.
//   * The RA4M1 has internal pull-UP only: GPIO_MODE_INPUT_PULLDOWN is
//     rejected.
//   * The DAC waveform generator runs on the mode periodic timer (see mode.c)
//     via the workbench mode's on_periodic callback.
// ============================================================================

#include <string.h>                   // memcpy (float -> wire)

#include "shell_commands.h"
#include "vendor/libcomm/opcodes.h"   // SHELL_STATUS_*
#include "ra4m1_hal.h"
#include "mode.h"
#include "spectral.h"                 // mode 2: averaged power spectrum
#include "goertzel.h"                 // mode 4: order-tracked Goertzel bank
#include "control.h"                  // motor slot: control core (Tier1/PendSV)
#include "ra4m1_rs485.h"              // RS-485 slave transport diagnostics
#include "bsp/board_api.h"            // board_millis()

// ---- RA4M1-specific command IDs (0x0110+: multi-mode control) --------------
// 0x0100..0x010E are the shared chip commands defined in shell_commands.h.

#define CMD_RESET           ((uint16_t)0x0003)   // soft reset to safe (motor off / DSP none)
#define CMD_STACK_HWM       ((uint16_t)0x0050)   // stack size + high-water mark
#define CMD_SET_MODE        ((uint16_t)0x0110)
#define CMD_GET_MODE        ((uint16_t)0x0111)

// Stack budget helpers (main.c).
extern uint32_t firmware_stack_size(void);
extern uint32_t firmware_stack_hwm(void);
#define CMD_ANALOG_START    ((uint16_t)0x0112)
#define CMD_ANALOG_READ     ((uint16_t)0x0113)
#define CMD_ANALOG_STOP     ((uint16_t)0x0114)

// 0x0115..0x0118: mode-2 spectral (averaged power spectrum) — see spectral.h.
#define CMD_SPECTRAL_START  ((uint16_t)0x0115)
#define CMD_SPECTRAL_STATUS ((uint16_t)0x0116)
#define CMD_SPECTRAL_READ   ((uint16_t)0x0117)
#define CMD_SPECTRAL_STOP   ((uint16_t)0x0118)
#define CMD_CEPSTRUM_READ   ((uint16_t)0x0140)   // real cepstrum (quefrency bins)

// 0x0119..0x011F: mode-4 Goertzel (order-tracked bin bank) — see goertzel.h.
#define CMD_GOERTZEL_CONFIG      ((uint16_t)0x0119)
#define CMD_GOERTZEL_SET_ORDERS  ((uint16_t)0x011A)
#define CMD_GOERTZEL_START       ((uint16_t)0x011B)
#define CMD_GOERTZEL_STATUS      ((uint16_t)0x011C)
#define CMD_GOERTZEL_READ        ((uint16_t)0x011D)
#define CMD_GOERTZEL_STOP        ((uint16_t)0x011E)
#define CMD_GOERTZEL_INJECT_RPM  ((uint16_t)0x011F)

// 0x0150..0x0157: motor-control core (the "motor slot" — see control.h).
// NOTE: the locked design opcode map places these at 0x0108/0x0109/0x010C/
// 0x010D/0x0110/0x0111/0x0120 — slots currently occupied on this shared HIL
// command surface by pwm_*/counter_*/set_mode/get_mode. Increment 1 lands the
// motor core ADDITIVELY at a fresh non-colliding block so the hardware-verified
// workbench HIL commands keep working; renumbering to the design map (and
// dropping the superseded pwm_*/counter_* on RA4M1) is a deliberate later
// cleanup paired with the dongle_console.lua update. design-map slot in comments.
#define CMD_SET_MOTOR_MODE  ((uint16_t)0x0150)   // design: 0x0110
#define CMD_GET_STATUS      ((uint16_t)0x0151)   // design: 0x0120
#define CMD_MOTOR_DRIVE     ((uint16_t)0x0152)   // design: 0x0109
#define CMD_DAC_PROBE       ((uint16_t)0x0153)   // design: 0x0108
#define CMD_ENCODER_READ    ((uint16_t)0x0154)   // design: 0x010D
#define CMD_ENCODER_RESET   ((uint16_t)0x0155)   // design: 0x010C
#define CMD_SET_DSP_MODE    ((uint16_t)0x0156)   // design: 0x0111
#define CMD_MOTOR_CONFIG    ((uint16_t)0x0157)   // overcurrent + counts_per_rev
#define CMD_PWM_TEST        ((uint16_t)0x0158)   // bench: 20 kHz PWM on D8, raw duty counts
#define CMD_DAC_CONST       ((uint16_t)0x0159)   // bench: DAC constant level (A0)
#define CMD_DAC_SQUARE      ((uint16_t)0x015A)   // bench: DAC square wave (A0→A1 decimation test)
#define CMD_STREAMS_READ    ((uint16_t)0x015B)   // read the 9 decimator taps
#define CMD_ENCODER_STIM    ((uint16_t)0x015C)   // bench: Gray-code quadrature on D4/D5
#define CMD_RS485_STATS     ((uint16_t)0x015D)   // bench: RS-485 SCI2 driver counters (slave bring-up)

// ---- DAC waveform-generator state ------------------------------------------
// Lives in the shared mode arena — only the workbench mode owns it. Written by
// the command handlers, consumed by the periodic ISR (hence volatile).

#define DAC_WF_PHASE_STEPS  64u

typedef struct {
    volatile bool     active;
    uint8_t           waveform_type;
    uint16_t          amplitude;        // peak-to-peak, 0..4095
    uint16_t          offset;           // DC center, 0..4095
    uint32_t          isrs_remaining;   // 0 = infinite
    uint8_t           phase;            // 0..63
} wf_state_t;

// g_mode_arena is aligned(8); the void* hop tells the compiler the cast is
// alignment-safe (silences -Wcast-align on the uint8_t[] -> struct cast).
#define WF  (*(volatile wf_state_t*)(void*)g_mode_arena)

// ============================================================================
// GPIO — raw (port,pin); host resolves board labels. port 0..9, pin 0..15.
// ============================================================================

static bool validate_pin(uint8_t port, uint8_t pin)
{
    return port <= 9u && pin <= 15u;
}

// CMD_GPIO_CONFIG — args: port:u8 pin:u8 mode:u8 ; result: empty
static uint8_t cmd_gpio_config(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t port = sr_u8(args);
    uint8_t pin  = sr_u8(args);
    uint8_t mode = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (!validate_pin(port, pin))  return SHELL_STATUS_BAD_ARGS;
    // RA4M1 has internal pull-up only — no pull-down.
    if (mode > GPIO_MODE_INPUT_PULLUP) return SHELL_STATUS_BAD_ARGS;

    hal_gpio_config(port, pin,
                    mode == GPIO_MODE_OUTPUT,
                    mode == GPIO_MODE_INPUT_PULLUP);
    return SHELL_STATUS_OK;
}

