glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
// CMD_GPIO_WRITE — args: port:u8 pin:u8 level:u8 ; result: empty
static uint8_t cmd_gpio_write(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t port  = sr_u8(args);
    uint8_t pin   = sr_u8(args);
    uint8_t level = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (!validate_pin(port, pin))  return SHELL_STATUS_BAD_ARGS;
    if (level > 1u)                return SHELL_STATUS_BAD_ARGS;

    hal_gpio_write(port, pin, level != 0u);
    return SHELL_STATUS_OK;
}

// CMD_GPIO_READ — args: port:u8 pin:u8 ; result: level:u8
static uint8_t cmd_gpio_read(shell_reader_t* args, shell_writer_t* result)
{
    uint8_t port = sr_u8(args);
    uint8_t pin  = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (!validate_pin(port, pin))  return SHELL_STATUS_BAD_ARGS;

    sw_u8(result, hal_gpio_read(port, pin));
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ============================================================================
// DAC — 12-bit, fixed pin D0/P014.
// ============================================================================

// CMD_DAC_WRITE — args: value:u16 (0..4095) ; result: empty
static uint8_t cmd_dac_write(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint16_t value = sr_u16(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (value > 4095u)             return SHELL_STATUS_BAD_ARGS;

    // A static write wins over any running waveform.
    if (WF.active) {
        WF.active = false;
        mode_periodic_stop();
    }
    hal_dac_write(value);
    return SHELL_STATUS_OK;
}

// ============================================================================
// DAC waveform generator — runs on the mode periodic timer (mode.c). The
// workbench mode's on_periodic callback (workbench_periodic_isr, below) steps
// one sample per ISR; 64 phase steps per output cycle.
// ============================================================================

#define DAC_WF_FREQ_MIN     50u
#define DAC_WF_FREQ_MAX     500u

#define DAC_WF_TYPE_SINE       0u
#define DAC_WF_TYPE_RAMP_UP    1u
#define DAC_WF_TYPE_RAMP_DOWN  2u
#define DAC_WF_TYPE_SQUARE     3u

// 64-point 12-bit sine LUT, centered 2048, peak amplitude 2047.
static const uint16_t g_sine_lut12[DAC_WF_PHASE_STEPS] = {
    2048, 2249, 2447, 2642, 2831, 3013, 3185, 3347,
    3495, 3630, 3750, 3853, 3939, 4007, 4056, 4085,
    4095, 4085, 4056, 4007, 3939, 3853, 3750, 3630,
    3495, 3347, 3185, 3013, 2831, 2642, 2447, 2249,
    2048, 1847, 1649, 1454, 1265, 1083,  911,  749,
     601,  466,  346,  243,  157,   89,   40,   11,
       1,   11,   40,   89,  157,  243,  346,  466,
     601,  749,  911, 1083, 1265, 1454, 1649, 1847,
};

// workbench mode on_periodic callback — see g_modes[] in mode.c.
void workbench_periodic_isr(void)
{
    if (!WF.active) {
        return;
    }

    int32_t amp    = (int32_t)WF.amplitude;
    int32_t offset = (int32_t)WF.offset;
    int32_t sample;

    switch (WF.waveform_type) {
        case DAC_WF_TYPE_SINE: {
            int32_t lut    = (int32_t)g_sine_lut12[WF.phase] - 2048;  // -2048..+2047
            int32_t scaled = lut * amp / 4095;
            sample = offset + scaled;
            break;
        }
        case DAC_WF_TYPE_RAMP_UP: {
            int32_t v = (int32_t)WF.phase * amp / (int32_t)(DAC_WF_PHASE_STEPS - 1u);
            sample = offset - amp / 2 + v;
            break;
        }
        case DAC_WF_TYPE_RAMP_DOWN: {
            int32_t v = (int32_t)(DAC_WF_PHASE_STEPS - 1u - WF.phase) * amp
                      / (int32_t)(DAC_WF_PHASE_STEPS - 1u);
            sample = offset - amp / 2 + v;
            break;
        }
        case DAC_WF_TYPE_SQUARE:
        default:
            sample = (WF.phase < (DAC_WF_PHASE_STEPS / 2u))
                   ? offset + amp / 2
                   : offset - amp / 2;
            break;
    }

    if (sample < 0)       sample = 0;
    if (sample > 4095)    sample = 4095;
    hal_dac_write((uint16_t)sample);

    WF.phase = (uint8_t)((WF.phase + 1u) % DAC_WF_PHASE_STEPS);

    // Duration: 0 = infinite; otherwise stop when the ISR budget runs out.
    if (WF.isrs_remaining != 0u) {
        if (--WF.isrs_remaining == 0u) {
            WF.active = false;
            mode_periodic_stop();
        }
    }
}

// CMD_DAC_WAVEFORM_WRITE — args: waveform:u8 amplitude:u16 offset:u16
//                                frequency_hz:u32 duration_ms:u32 ; result: empty
static uint8_t cmd_dac_waveform_write(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t  waveform    = sr_u8(args);
    uint16_t amplitude   = sr_u16(args);
    uint16_t offset      = sr_u16(args);
    uint32_t frequency   = sr_u32(args);
    uint32_t duration_ms = sr_u32(args);
    if (args->overflow)               return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)      return SHELL_STATUS_BAD_ARGS;
    if (waveform > DAC_WF_TYPE_SQUARE) return SHELL_STATUS_BAD_ARGS;
    if (amplitude > 4095u || offset > 4095u) return SHELL_STATUS_BAD_ARGS;
    if (frequency < DAC_WF_FREQ_MIN || frequency > DAC_WF_FREQ_MAX)
                                      return SHELL_STATUS_BAD_ARGS;

    uint32_t isr_rate = frequency * DAC_WF_PHASE_STEPS;
    uint32_t isrs = (duration_ms == 0u)
                  ? 0u
                  : (duration_ms * isr_rate / 1000u);

    // Stop any running waveform, install the new state, then start the timer.
    mode_periodic_stop();
    hal_dac_write(offset);                 // force DAC init + park at offset
    WF.waveform_type  = waveform;
    WF.amplitude      = amplitude;
    WF.offset         = offset;
    WF.isrs_remaining = isrs;
    WF.phase          = 0u;
    WF.active         = true;
    mode_periodic_start(isr_rate);
    return SHELL_STATUS_OK;
}

// CMD_DAC_STOP — args: empty ; result: empty. DAC holds the last sample.
static uint8_t cmd_dac_stop(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    WF.active = false;
    mode_periodic_stop();
    return SHELL_STATUS_OK;
}

// ============================================================================
// ADC — 14-bit. Channels are RA4M1 AN numbers (D1=0 D2=1 D3=2 D0=9 D5=22).
// ============================================================================

