glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
// CMD_ADC_READ — args: channel:u8 ; result: value:u16 (0..16383)
static uint8_t cmd_adc_read(shell_reader_t* args, shell_writer_t* result)
{
    uint8_t channel = sr_u8(args);
    if (args->overflow)              return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)     return SHELL_STATUS_BAD_ARGS;
    if (!hal_adc_channel_valid(channel)) return SHELL_STATUS_BAD_ARGS;

    sw_u16(result, hal_adc_read(channel));
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_ADC_CAPTURE — multi-channel buffered capture.
// args:   num_channels:u8 (1..8) channels:u8[num_channels]
//         num_samples:u16 delta_time_us:u32 (>= 1000)
// result: num_channels:u8 num_samples:u16 samples:u16[num_channels*num_samples]
// v1 cap: total samples <= 60 to fit one OP_SHELL_REPLY frame.
#define ADC_CAPTURE_MAX_CHANNELS  8u
#define ADC_CAPTURE_MAX_SAMPLES   60u
#define ADC_CAPTURE_MIN_DELTA_US  1000u

static uint8_t cmd_adc_capture(shell_reader_t* args, shell_writer_t* result)
{
    uint8_t num_channels = sr_u8(args);
    if (args->overflow) return SHELL_STATUS_BAD_ARGS;
    if (num_channels == 0u || num_channels > ADC_CAPTURE_MAX_CHANNELS)
        return SHELL_STATUS_BAD_ARGS;

    uint8_t channels[ADC_CAPTURE_MAX_CHANNELS];
    for (uint8_t i = 0; i < num_channels; i++) {
        channels[i] = sr_u8(args);
        if (args->overflow)                       return SHELL_STATUS_BAD_ARGS;
        if (!hal_adc_channel_valid(channels[i]))  return SHELL_STATUS_BAD_ARGS;
    }

    uint16_t num_samples   = sr_u16(args);
    uint32_t delta_time_us = sr_u32(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (num_samples == 0u)         return SHELL_STATUS_BAD_ARGS;
    if (delta_time_us < ADC_CAPTURE_MIN_DELTA_US) return SHELL_STATUS_BAD_ARGS;

    uint32_t total = (uint32_t)num_channels * (uint32_t)num_samples;
    if (total > ADC_CAPTURE_MAX_SAMPLES) return SHELL_STATUS_BAD_ARGS;

    uint32_t delta_ms = delta_time_us / 1000u;

    sw_u8 (result, num_channels);
    sw_u16(result, num_samples);

    for (uint16_t s = 0; s < num_samples; s++) {
        uint32_t slot_start_ms = board_millis();

        for (uint8_t c = 0; c < num_channels; c++) {
            sw_u16(result, hal_adc_read(channels[c]));
            if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
        }

        if (s < num_samples - 1u) {
            while ((board_millis() - slot_start_ms) < delta_ms) {
                // hold the sample slot
            }
        }
    }
    return SHELL_STATUS_OK;
}

// ============================================================================
// PWM — GPT3 / GTIOC3A on D8/P111. v1: only D8 is wired.
// ============================================================================

// CMD_PWM_CONFIG — args: port:u8 pin:u8 freq_hz:u32 resolution:u8 ; result: empty
// The RA4M1 PWM is a fixed 12-bit interface (duty 0..4095) — the duty-dither
// ISR resolves 12-bit at any supported frequency, so `resolution` is accepted
// for wire-compatibility with the SAMD21 but not otherwise used.
static uint8_t cmd_pwm_config(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t  port       = sr_u8 (args);
    uint8_t  pin        = sr_u8 (args);
    uint32_t freq_hz    = sr_u32(args);
    uint8_t  resolution = sr_u8 (args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (port != 1u || pin != 11u)  return SHELL_STATUS_BAD_ARGS;   // D8/P111 only
    if (resolution != 8u && resolution != 10u && resolution != 11u
        && resolution != 12u && resolution != 16u) return SHELL_STATUS_BAD_ARGS;

    if (!hal_pwm_config(freq_hz)) return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_PWM_SET — args: duty:u16 (0..4095, 12-bit) ; result: empty
static uint8_t cmd_pwm_set(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint16_t duty = sr_u16(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (!hal_pwm_active())         return SHELL_STATUS_BAD_ARGS;
    if (duty > 4095u)              return SHELL_STATUS_BAD_ARGS;

    hal_pwm_set(duty);
    return SHELL_STATUS_OK;
}

// CMD_PWM_TEARDOWN — args: empty ; result: empty
static uint8_t cmd_pwm_teardown(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    hal_pwm_teardown();
    return SHELL_STATUS_OK;
}

// ============================================================================
// Counter — the COUNTER_* commands drive one of two backends, selected by the
// COUNTER_SETUP pin:
//   D9/D10 (P110/P109) -> GPT1 x4 quadrature encoder — COUNTER_READ returns a
//                         signed 32-bit position.
//   D7    (P301)       -> GPT4 plain 16-bit rising-edge counter — COUNTER_READ
//                         returns an unsigned count (e.g. for the D8 PWM-count
//                         loopback).
// Both report through the same u32 result; the host knows which by the pin.
// ============================================================================

#define CTR_NONE     0u
#define CTR_ENCODER  1u   // GPT1 quadrature, D9/D10
#define CTR_COUNTER  2u   // GPT4 edge counter, D7

static uint8_t g_counter_backend = CTR_NONE;

// CMD_COUNTER_SETUP — args: port:u8 pin:u8 ; result: empty.
// Pin selects the backend: D9/D10 (1,9)/(1,10) -> quadrature encoder;
// D7 (3,1) -> GPT4 edge counter.
static uint8_t cmd_counter_setup(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t port = sr_u8(args);
    uint8_t pin  = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;

    if (port == 1u && (pin == 9u || pin == 10u)) {
        hal_encoder_setup();                        // D9/D10 -> GPT1 quadrature
        g_counter_backend = CTR_ENCODER;
    } else if (port == 3u && pin == 1u) {
#if defined(ROLE_SLAVE)
        // D7/P301 is SCI2 RXD2 in slave mode — the RS-485 bus owns the pin.
        return SHELL_STATUS_BAD_ARGS;
#else
        hal_counter_setup();                        // D7 -> GPT4 edge counter
        g_counter_backend = CTR_COUNTER;
#endif
    } else {
        return SHELL_STATUS_BAD_ARGS;
    }
    return SHELL_STATUS_OK;
}

