glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
// CMD_COUNTER_RESET — args: empty ; result: empty
static uint8_t cmd_counter_reset(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;

    if (g_counter_backend == CTR_ENCODER)      hal_encoder_reset();
    else if (g_counter_backend == CTR_COUNTER) hal_counter_reset();
    else return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_COUNTER_READ — args: reset_flag:u8 ; result: count:u32
// Encoder backend: signed position (host reads as int32). Counter backend:
// unsigned edge count.
static uint8_t cmd_counter_read(shell_reader_t* args, shell_writer_t* result)
{
    uint8_t reset_flag = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;

    uint32_t value;
    if (g_counter_backend == CTR_ENCODER) {
        value = (uint32_t)hal_encoder_read();
        if (reset_flag != 0u) hal_encoder_reset();
    } else if (g_counter_backend == CTR_COUNTER) {
        value = hal_counter_read();
        if (reset_flag != 0u) hal_counter_reset();
    } else {
        return SHELL_STATUS_BAD_ARGS;
    }
    sw_u32(result, value);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_COUNTER_STOP — args: empty ; result: empty
static uint8_t cmd_counter_stop(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (g_counter_backend == CTR_ENCODER)      hal_encoder_stop();
    else if (g_counter_backend == CTR_COUNTER) hal_counter_stop();
    g_counter_backend = CTR_NONE;
    return SHELL_STATUS_OK;
}

// ============================================================================
// Analog collection — background statistics on the 4 ADC channels.
//
// ANALOG_START begins a ~1 kHz main-loop sampler over D1/D2/D3/D5
// (AN0/AN1/AN2/AN22); per channel it keeps Welford running mean + M2 plus
// min/max. ANALOG_READ snapshots {n, mean, stddev, min, max} for the interval
// since the last READ, then zeros the accumulators (reset-on-read) — sampling
// continues. ANALOG_STOP halts sampling, leaving the last interval for a final
// READ. D0 (the DAC) is not sampled.
//
// The sampler runs in the main loop (workbench_analog_poll), so it can't delay
// the DAC-waveform ISR and shares the main-loop context with the command
// handlers — no race on the accumulators, no IRQ masking needed.
// ============================================================================

#define ANALOG_CH_COUNT  4u

// The 4 analog-capable XIAO pins, as ADC AN channels (D1, D2, D3, D5).
static const uint8_t g_analog_channels[ANALOG_CH_COUNT] = { 0u, 1u, 2u, 22u };

static struct {
    volatile bool active;
    uint32_t      last_ms;                  // 1 kHz rate-limit anchor
    uint32_t      n;                        // samples since the last READ
    float         mean[ANALOG_CH_COUNT];    // Welford running mean
    float         m2[ANALOG_CH_COUNT];      // Welford sum of squared deltas
    uint16_t      min[ANALOG_CH_COUNT];
    uint16_t      max[ANALOG_CH_COUNT];
} g_analog;

static void analog_reset_accumulators(void)
{
    g_analog.n = 0u;
    for (uint32_t i = 0; i < ANALOG_CH_COUNT; i++) {
        g_analog.mean[i] = 0.0f;
        g_analog.m2[i]   = 0.0f;
        g_analog.min[i]  = 0xFFFFu;
        g_analog.max[i]  = 0u;
    }
}

// Called every main-loop iteration (main.c). Samples the 4 channels at ~1 kHz
// and folds each into the per-channel Welford accumulators + min/max.
void workbench_analog_poll(void)
{
    if (!g_analog.active) {
        return;
    }
    // The control core owns the ADC (and drives P100/AN022 as an H-bridge line)
    // while a motor mode runs — don't let the workbench sampler fight it.
    if (control_get_motor_mode() != MOTOR_IDLE) {
        return;
    }
    uint32_t now = board_millis();
    if ((now - g_analog.last_ms) < 1u) {            // ~1 kHz cap
        return;
    }
    g_analog.last_ms = now;
    g_analog.n++;

    for (uint32_t i = 0; i < ANALOG_CH_COUNT; i++) {
        uint16_t v = hal_adc_read(g_analog_channels[i]);
        // Welford online mean + M2.
        float delta = (float)v - g_analog.mean[i];
        g_analog.mean[i] += delta / (float)g_analog.n;
        float delta2 = (float)v - g_analog.mean[i];
        g_analog.m2[i] += delta * delta2;
        // min / max.
        if (v < g_analog.min[i]) g_analog.min[i] = v;
        if (v > g_analog.max[i]) g_analog.max[i] = v;
    }
}

// Write a little-endian float32 to the shell result.
static void sw_f32(shell_writer_t* w, float f)
{
    uint32_t bits;
    memcpy(&bits, &f, sizeof(bits));
    sw_u32(w, bits);
}

// Read a little-endian float32 from the shell args. Bit-pattern transfer so a
// NaN or ±Inf payload round-trips unchanged (used by CMD_GOERTZEL_INJECT_RPM).
static float sr_f32(shell_reader_t* r)
{
    uint32_t bits = sr_u32(r);
    float f;
    memcpy(&f, &bits, sizeof(f));
    return f;
}

// CMD_ANALOG_START — args: empty ; result: empty
static uint8_t cmd_analog_start(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    analog_reset_accumulators();
    g_analog.last_ms = board_millis();
    g_analog.active  = true;
    return SHELL_STATUS_OK;
}

// CMD_ANALOG_READ — args: empty
// result: n:u32  then 4x { mean:f32  stddev:f32  min:u16  max:u16 }  (52 B)
// Stats for the interval since the last READ; resets the accumulators after.
static uint8_t cmd_analog_read(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    uint32_t n = g_analog.n;
    sw_u32(result, n);
    for (uint32_t i = 0; i < ANALOG_CH_COUNT; i++) {
        float    mean   = (n > 0u) ? g_analog.mean[i] : 0.0f;
        float    stddev = (n > 1u)
                        ? __builtin_sqrtf(g_analog.m2[i] / (float)(n - 1u))
                        : 0.0f;
        uint16_t mn     = (n > 0u) ? g_analog.min[i] : 0u;
        uint16_t mx     = (n > 0u) ? g_analog.max[i] : 0u;
        sw_f32(result, mean);
        sw_f32(result, stddev);
        sw_u16(result, mn);
        sw_u16(result, mx);
    }
    if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;

