glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
    // Reset-on-read: the next READ reports a fresh interval; sampling continues.
    analog_reset_accumulators();
    return SHELL_STATUS_OK;
}

// CMD_ANALOG_STOP — args: empty ; result: empty.
// Halts sampling; the last interval stays for one final ANALOG_READ.
static uint8_t cmd_analog_stop(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    g_analog.active = false;
    return SHELL_STATUS_OK;
}

// ============================================================================
// Spectral — mode 2: averaged power spectrum. See spectral.h for the model.
// SPECTRAL_START switches mode 1 → mode 2 + begins capture; STOP returns to
// mode 1. STATUS / READ are read-only and tolerate the wrong mode (returning
// IDLE state / 0 floats) so the host can poll safely after a STOP.
// ============================================================================

// CMD_SPECTRAL_START — args: fs_code:u8 channel:u8 target_frames:u16
//                     result: empty
static uint8_t cmd_spectral_start(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t  source        = sr_u8 (args);   // CONTROL_RATE_20K(0)/_1K(1)/_100(2)
    uint8_t  channel       = sr_u8 (args);   // 0..2 = A1/A2/A3
    uint16_t target_frames = sr_u16(args);   // Welch averages
    // compute is optional (4th byte): SPECTRAL_COMPUTE_PSD/CEPSTRUM/BOTH; absent → PSD.
    uint8_t  compute       = (sr_remaining(args) >= 1u) ? sr_u8(args) : SPECTRAL_COMPUTE_PSD;
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    // Offline op: spectral_start brings sampling online, feeds itself from the
    // selected decimated stream, and takes the chip offline on completion. No
    // mode switch — spectral is a Tier-0 consumer now, runs with the motor IDLE.
    if (!spectral_start(source, channel, target_frames, compute)) {
        return SHELL_STATUS_CMD_FAILED;      // bad args or motor busy
    }
    return SHELL_STATUS_OK;
}

// CMD_SPECTRAL_STATUS — args: empty
// result: state:u8 frames_done:u32 frames_target:u16 fs_code:u8 channel:u8
//         (9 bytes total)
static uint8_t cmd_spectral_status(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    // Read state from the spectral module. If we're not in MODE_SPECTRAL the
    // arena bytes belong to another mode — report IDLE/zero so the host's
    // poll path doesn't misinterpret garbage.
    // State lives in resident RAM now — valid any time, no mode guard needed.
    sw_u8 (result, (uint8_t)spectral_state());
    sw_u32(result, spectral_frames_done());
    sw_u16(result, spectral_target_frames());
    sw_u8 (result, spectral_source());        // CONTROL_RATE_* (was fs_code)
    sw_u8 (result, 0u);                        // reserved
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_SPECTRAL_READ — args: offset:u16 count:u16
// result: count:u16  bins:f32[count]
// count caps at 30 (SHELL_RESULT_MAX=125 → 2 header + 30*4 = 122 bytes).
static uint8_t cmd_spectral_read(shell_reader_t* args, shell_writer_t* result)
{
    uint16_t offset = sr_u16(args);
    uint16_t count  = sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    if (count > 30u) count = 30u;

    float bins[30];
    uint16_t n = spectral_read_bins(offset, count, bins);
    sw_u16(result, n);
    for (uint32_t i = 0; i < n; i++) {
        sw_f32(result, bins[i]);
    }
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_SPECTRAL_STOP — args: empty ; result: empty.
// Aborts the capture and drops back to MODE_WORKBENCH.
static uint8_t cmd_spectral_stop(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    spectral_stop();
    return SHELL_STATUS_OK;
}

// CMD_CEPSTRUM_READ — args: offset:u16 count:u16 ; result: count:u16 q[count]:f32
// Real cepstrum (quefrency bins 0..N/2). Valid only after a spectral run with
// compute=CEPSTRUM|BOTH completed; returns count=0 otherwise. count caps at 30.
static uint8_t cmd_cepstrum_read(shell_reader_t* args, shell_writer_t* result)
{
    uint16_t offset = sr_u16(args);
    uint16_t count  = sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    if (count > 30u) count = 30u;
    float bins[30];
    uint16_t n = cepstrum_read_bins(offset, count, bins);
    sw_u16(result, n);
    for (uint32_t i = 0; i < n; i++) {
        sw_f32(result, bins[i]);
    }
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ============================================================================
// Goertzel — mode 4: order-tracked bin bank for motor diagnostics.
// See goertzel.h for the architecture + per-block lifecycle.
//
// CONFIG sets scalars, SET_ORDERS pages the f32 order list (K up to 32),
// START switches to MODE_GOERTZEL + begins streaming. STATUS gives live
// counters / current RPM / gate state. READ pages mag2 accumulators and
// optionally resets them. INJECT_RPM overrides the encoder for bench
// testing without a motor (NaN clears the override).
// ============================================================================

// CMD_GOERTZEL_CONFIG — args:
//   sub_mode:u8 fs_code:u8 block_n:u16 channel:u8 gate_enabled:u8
//   order_count:u8 _pad:u8 accel_thresh:f32 min_rpm:f32
// result: empty
static uint8_t cmd_goertzel_config(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t  sub_mode     = sr_u8 (args);
    uint8_t  fs_code      = sr_u8 (args);
    uint16_t block_n      = sr_u16(args);
    uint8_t  channel      = sr_u8 (args);
    uint8_t  gate_enabled = sr_u8 (args);
    uint8_t  order_count  = sr_u8 (args);
    (void)                  sr_u8 (args);    // _pad
    float    accel_thresh = sr_f32(args);
    float    min_rpm      = sr_f32(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    // CONFIG is the entry into MODE_GOERTZEL: switching now (a) memsets the
    // shared arena (clean slate) and (b) lets subsequent SET_ORDERS / START
    // calls write to the arena without colliding with whatever mode owned it
    // before. mode_set is a no-op if we're already here, so re-CONFIG keeps
    // working without disturbing per-bin state we haven't touched yet.
    if (mode_set(MODE_GOERTZEL) != 0u) return SHELL_STATUS_CMD_FAILED;

    if (!goertzel_config(sub_mode, fs_code, block_n, channel,
                         gate_enabled, accel_thresh, min_rpm, order_count)) {
        return SHELL_STATUS_BAD_ARGS;
    }
    return SHELL_STATUS_OK;
}

// CMD_GOERTZEL_SET_ORDERS — args: offset:u8 count:u8 orders:f32[count]
// result: empty.  Requires CONFIG (which entered MODE_GOERTZEL) was called
// first. Pages to fit K=32 in the 124-byte SHELL_EXEC payload across up to
// 2 calls (max 30 floats per call).
static uint8_t cmd_goertzel_set_orders(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t offset = sr_u8(args);
    uint8_t count  = sr_u8(args);
    if (args->overflow)                       return SHELL_STATUS_BAD_ARGS;
    if (count == 0u || count > 30u)           return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != (uint16_t)count * 4u) return SHELL_STATUS_BAD_ARGS;
    if (mode_get() != MODE_GOERTZEL)          return SHELL_STATUS_CMD_FAILED;

