glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
    float buf[30];
    for (uint32_t i = 0; i < count; i++) {
        buf[i] = sr_f32(args);
    }
    if (args->overflow) return SHELL_STATUS_BAD_ARGS;

    if (!goertzel_set_orders(offset, count, buf)) return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_GOERTZEL_START — args: empty ; result: empty.
// Requires prior CONFIG + SET_ORDERS. Does NOT switch modes (CONFIG already
// did) — only kicks the ADC tick + Goertzel state machine.
static uint8_t cmd_goertzel_start(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0)        return SHELL_STATUS_BAD_ARGS;
    if (mode_get() != MODE_GOERTZEL)    return SHELL_STATUS_CMD_FAILED;
    if (!goertzel_start())              return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_GOERTZEL_STATUS — args: empty
// result: state:u8 gate_open:u8 _pad:u16 last_rpm:f32 rpm_change_rate:f32
//         n_blocks_accum:u32 n_blocks_total:u32   (20 bytes)
static uint8_t cmd_goertzel_status(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    uint8_t  state     = 0u;
    uint8_t  gate_open = 0u;
    uint32_t n_acc     = 0u;
    uint32_t n_total   = 0u;
    float    rpm       = 0.0f;
    if (mode_get() == MODE_GOERTZEL) {
        state     = (uint8_t)goertzel_state();
        gate_open = goertzel_gate_open();
        n_acc     = goertzel_n_blocks_accumulated();
        n_total   = goertzel_n_blocks_total();
        rpm       = goertzel_last_rpm();
    }
    sw_u8 (result, state);
    sw_u8 (result, gate_open);
    sw_u8 (result, 0u);          // pad
    sw_u8 (result, 0u);          // pad
    sw_f32(result, rpm);
    sw_f32(result, 0.0f);        // reserved for rpm_change_rate (not exposed yet)
    sw_u32(result, n_acc);
    sw_u32(result, n_total);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_GOERTZEL_READ — args: offset:u16 count:u16 reset:u8
// result: n_blocks:u32 count:u16 mag2:f32[count]
//   count capped at 28 (124-byte payload - 6 byte header / 4 = 29; round to 28 for headroom).
static uint8_t cmd_goertzel_read(shell_reader_t* args, shell_writer_t* result)
{
    uint16_t offset = sr_u16(args);
    uint16_t count  = sr_u16(args);
    uint8_t  reset  = sr_u8 (args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    if (count > 28u) count = 28u;

    float    bins[28];
    uint32_t n_blocks = 0u;
    uint16_t n        = 0u;
    if (mode_get() == MODE_GOERTZEL) {
        n = goertzel_read(offset, count, reset, bins, &n_blocks);
    }
    sw_u32(result, n_blocks);
    sw_u16(result, n);
    for (uint32_t i = 0; i < n; i++) {
        sw_f32(result, bins[i]);
    }
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_GOERTZEL_STOP — args: empty ; result: empty.
static uint8_t cmd_goertzel_stop(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (mode_get() == MODE_GOERTZEL) {
        goertzel_stop();
        mode_set(MODE_WORKBENCH);
    }
    return SHELL_STATUS_OK;
}

// CMD_GOERTZEL_INJECT_RPM — args: rpm:f32 ; result: empty.
// NaN re-enables encoder; any finite value overrides the encoder reading for
// the next block's coefficient refresh + gate check.
static uint8_t cmd_goertzel_inject_rpm(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    float rpm = sr_f32(args);
    if (args->overflow)              return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)     return SHELL_STATUS_BAD_ARGS;
    if (mode_get() != MODE_GOERTZEL) return SHELL_STATUS_CMD_FAILED;

    goertzel_inject_rpm(rpm);
    return SHELL_STATUS_OK;
}

// ============================================================================
// Mode control — the multi-mode foundation (see mode.h).
// ============================================================================

// CMD_SET_MODE — args: mode:u8 ; result: empty
static uint8_t cmd_set_mode(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t mode = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;

    // mode_set rejects out-of-range / not-yet-implemented modes.
    if (mode_set((device_mode_t)mode) != 0u) return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_GET_MODE — args: empty ; result: mode:u8
static uint8_t cmd_get_mode(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    sw_u8(result, (uint8_t)mode_get());
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ============================================================================
// Motor-control core — the "motor slot" (control.h). The control core runs
// independently of the mode.c DSP slot; these handlers are the host surface.
// All wire integers are little-endian; signed values transfer as their bit
// pattern through the unsigned sr_/sw_ helpers (raw-counts rule).
// ============================================================================

// CMD_SET_MOTOR_MODE — args: mode:u8 (IDLE=0/MANUAL=1/PID=2/SCURVE=3/WINDOW=4)
// result: empty. Entering a driving mode forces the DSP slot to NONE.
static uint8_t cmd_set_motor_mode(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t mode = sr_u8(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (control_set_motor_mode((motor_mode_t)mode) != 0u)
        return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_SET_DSP_MODE — args: mode:u8 (NONE=0/GOERTZEL=1/SPECTRAL=2/ANALOG=3)
// result: empty. Rejected while a motor mode owns the ADC (motor != IDLE).
static uint8_t cmd_set_dsp_mode(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t mode = sr_u8(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (control_get_motor_mode() != MOTOR_IDLE) return SHELL_STATUS_CMD_FAILED;

    device_mode_t dm;
    switch (mode) {
        case 0u: dm = MODE_WORKBENCH; break;   // NONE
        case 1u: dm = MODE_GOERTZEL;  break;
        case 2u: dm = MODE_SPECTRAL;  break;
        case 3u: dm = MODE_WORKBENCH; break;   // ANALOG runs in workbench
        default: return SHELL_STATUS_BAD_ARGS;
    }
    if (mode_set(dm) != 0u) return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_GET_STATUS — args: empty
// result: motor_mode:u8 motor_state:u8 dsp_mode:u8 fault:u8
//         speed:i32 position:i32 current:u16 duty:i16 op_token:u16  (20 bytes)
static uint8_t cmd_get_status(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    sw_u8 (result, (uint8_t)control_get_motor_mode());
    sw_u8 (result, (uint8_t)control_get_motor_state());
    sw_u8 (result, (uint8_t)mode_get());
    sw_u8 (result, control_fault());
    sw_u32(result, (uint32_t)control_velocity());
    sw_u32(result, (uint32_t)control_position());
    sw_u16(result, control_current_raw());
    sw_u16(result, (uint16_t)control_duty());
    sw_u16(result, 0u);                         // op_token (SCURVE increment)
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_MOTOR_DRIVE — args: duty:i16 (-4095..4095) ; result: empty.
// Open-loop direct drive; only valid in MOTOR_MANUAL.
static uint8_t cmd_motor_drive(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    int16_t duty = (int16_t)sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (control_motor_drive(duty) != 0u) return SHELL_STATUS_CMD_FAILED;  // not MANUAL
    return SHELL_STATUS_OK;
}

// CMD_DAC_PROBE — args: source:u8 scale:i16 offset:i16 ; result: empty.
// DAC(A0) mirrors one of the 9 ADC streams or a control var (control.h). Tears
// down any running DAC waveform (one DAC). Emits only while a motor mode samples.
static uint8_t cmd_dac_probe(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint8_t source = sr_u8 (args);
    int16_t scale  = (int16_t)sr_u16(args);
    int16_t offset = (int16_t)sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    if (WF.active) {                            // a static probe wins over a waveform
        WF.active = false;
        mode_periodic_stop();
    }
    if (control_dac_probe(source, scale, offset) != 0u) return SHELL_STATUS_BAD_ARGS;
    return SHELL_STATUS_OK;
}

// CMD_ENCODER_READ — args: empty ; result: position:i32 velocity:i32
static uint8_t cmd_encoder_read(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    sw_u32(result, (uint32_t)control_position());
    sw_u32(result, (uint32_t)control_velocity());
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_ENCODER_RESET — args: empty ; result: empty
static uint8_t cmd_encoder_reset(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    control_encoder_reset();
    return SHELL_STATUS_OK;
}

