glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/ra4m1_commands.c
// CMD_MOTOR_CONFIG — args: overcurrent_raw:u16 counts_per_rev:u32 ; result: empty.
// overcurrent_raw = A1 raw-count fast cutout (0 = disabled). counts_per_rev
// enables on-chip RPM / order-tracking (0 = unknown).
static uint8_t cmd_motor_config(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint16_t oc  = sr_u16(args);
    uint32_t cpr = sr_u32(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    control_set_overcurrent(oc);
    control_set_counts_per_rev(cpr);
    return SHELL_STATUS_OK;
}

// CMD_PWM_TEST — args: counts:u16 (0..period) ; result: period:u16.
// Bench scope tool: lazy-configures GPT3 at 20 kHz on D8 and sets the duty to
// `counts` raw timer counts. Returns the period (max counts = 100% duty).
// Decoupled from the motor modes / ISRs — usable in IDLE.
static uint8_t cmd_pwm_test(shell_reader_t* args, shell_writer_t* result)
{
    uint16_t counts = sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    uint16_t period = control_pwm_test(counts);
    sw_u16(result, period);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_DAC_CONST — args: value:u16 (0..4095) ; result: empty. DAC held constant.
static uint8_t cmd_dac_const(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint16_t value = sr_u16(args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (value > 4095u)           return SHELL_STATUS_BAD_ARGS;
    control_dac_const(value);
    return SHELL_STATUS_OK;
}

// CMD_DAC_SQUARE — args: freq_hz:u16 low:u16 high:u16 ; result: realized_hz:u16.
// freq_hz 0 = stop. The square is generated in the 20 kHz sample ISR, so a
// sampling mode (MANUAL) must be active for it to toggle. For the A0→A1 loopback.
static uint8_t cmd_dac_square(shell_reader_t* args, shell_writer_t* result)
{
    uint16_t freq = sr_u16(args);
    uint16_t low  = sr_u16(args);
    uint16_t high = sr_u16(args);
    if (args->overflow)              return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)     return SHELL_STATUS_BAD_ARGS;
    if (low > 4095u || high > 4095u) return SHELL_STATUS_BAD_ARGS;
    uint16_t realized = control_dac_square(freq, low, high);
    sw_u16(result, realized);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_STREAMS_READ — args: empty ; result: 9× u16 = [A1,A2,A3]@20k, @1k, @100.
static uint8_t cmd_streams_read(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    uint16_t s[9];
    control_streams(s);
    for (uint32_t i = 0; i < 9u; i++) sw_u16(result, s[i]);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_ENCODER_STIM — args: rate_hz:u16 dir:u8 ; result: empty. rate_hz 0 = stop.
// Bench encoder loopback: drives a Gray-code quadrature on D4/D5 at rate_hz
// counts/sec. Jumper D4→D10, D5→D9; then encoder_read velocity ≈ ±rate_hz.
static uint8_t cmd_encoder_stim(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    uint16_t rate = sr_u16(args);
    uint8_t  dir  = sr_u8 (args);
    if (args->overflow)          return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (control_encoder_stim(rate, dir) != 0u) return SHELL_STATUS_CMD_FAILED;
    return SHELL_STATUS_OK;
}

// CMD_RESET — args: empty ; result: empty. Soft reset to a safe state (NOT a
// reboot — keeps the USB link): stop bench/DSP activity, motor → IDLE (sampling
// off, H-bridge coast), DSP slot → NONE.
static uint8_t cmd_reset(shell_reader_t* args, shell_writer_t* result)
{
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    control_encoder_stim(0u, 0u);          // stop stim (→ analysis off)
    spectral_stop();                       // stop any spectral/analysis run
    control_dac_probe_stop();
    control_set_motor_mode(MOTOR_IDLE);    // motor off, sampling stop, coast
    mode_set(MODE_WORKBENCH);              // DSP slot → NONE
    return SHELL_STATUS_OK;
}

// CMD_STACK_HWM — args: empty ; result: stack_size:u32 hwm_used:u32 (host: free = size-hwm).
static uint8_t cmd_stack_hwm(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    sw_u32(result, firmware_stack_size());
    sw_u32(result, firmware_stack_hwm());
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// CMD_RS485_STATS — bench diagnostic for the SCI2 slave bring-up. No args.
// Result: rx_words u32, frames_ok u32, crc_fail u32, overrun u32, tx_frames u32,
// last_tx_len u8. rx_words>0 proves the slave hears the BC; frames_ok>0 proves a
// CRC-valid frame addressed to us assembled. All zero on a ROLE_DONGLE build.
static uint8_t cmd_rs485_stats(shell_reader_t* args, shell_writer_t* result)
{
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    // First 4 u32 = the contract dongle_console decodes (rx_words, frames_ok,
    // crc_fail, overrun). Everything after is bring-up trace, parsed by hand.
    sw_u32(result, rs485_rx_word_count());
    sw_u32(result, rs485_frames_ok_count());
    sw_u32(result, rs485_crc_fail_count());
    sw_u32(result, rs485_rx_overrun_count());
    // Bring-up trace: config readback (SMR, SCR, SEMR, BRR) + last 8 raw words.
    uint8_t  regs[4];
    uint16_t words[8];
    rs485_dbg_regs(regs);
    rs485_dbg_words(words);
    for (uint32_t i = 0; i < 4u; i++) sw_u8(result, regs[i]);
    for (uint32_t i = 0; i < 8u; i++) sw_u16(result, words[i]);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ---- chip-specific dispatch table ------------------------------------------

static const shell_cmd_entry_t g_chip_commands[] = {
    { CMD_RESET,              "reset",              cmd_reset              },
    { CMD_STACK_HWM,          "stack_hwm",          cmd_stack_hwm          },
    { CMD_GPIO_CONFIG,        "gpio_config",        cmd_gpio_config        },
    { CMD_GPIO_WRITE,         "gpio_write",         cmd_gpio_write         },
    { CMD_GPIO_READ,          "gpio_read",          cmd_gpio_read          },
    { CMD_DAC_WRITE,          "dac_write",          cmd_dac_write          },
    { CMD_ADC_READ,           "adc_read",           cmd_adc_read           },
    { CMD_DAC_WAVEFORM_WRITE, "dac_waveform_write", cmd_dac_waveform_write },
    { CMD_DAC_STOP,           "dac_stop",           cmd_dac_stop           },
    { CMD_ADC_CAPTURE,        "adc_capture",        cmd_adc_capture        },
    { CMD_PWM_CONFIG,         "pwm_config",         cmd_pwm_config         },
    { CMD_PWM_SET,            "pwm_set",            cmd_pwm_set            },
    { CMD_PWM_TEARDOWN,       "pwm_teardown",       cmd_pwm_teardown       },
    { CMD_COUNTER_SETUP,      "counter_setup",      cmd_counter_setup      },
    { CMD_COUNTER_RESET,      "counter_reset",      cmd_counter_reset      },
    { CMD_COUNTER_READ,       "counter_read",       cmd_counter_read       },
    { CMD_COUNTER_STOP,       "counter_stop",       cmd_counter_stop       },
    { CMD_SET_MODE,           "set_mode",           cmd_set_mode           },
    { CMD_GET_MODE,           "get_mode",           cmd_get_mode           },
    { CMD_ANALOG_START,       "analog_start",       cmd_analog_start       },
    { CMD_ANALOG_READ,        "analog_read",        cmd_analog_read        },
    { CMD_ANALOG_STOP,        "analog_stop",        cmd_analog_stop        },
    { CMD_SPECTRAL_START,     "spectral_start",     cmd_spectral_start     },
    { CMD_SPECTRAL_STATUS,    "spectral_status",    cmd_spectral_status    },
    { CMD_SPECTRAL_READ,      "spectral_read",      cmd_spectral_read      },
    { CMD_SPECTRAL_STOP,      "spectral_stop",      cmd_spectral_stop      },
    { CMD_CEPSTRUM_READ,      "cepstrum_read",      cmd_cepstrum_read      },
    { CMD_GOERTZEL_CONFIG,     "goertzel_config",     cmd_goertzel_config     },
    { CMD_GOERTZEL_SET_ORDERS, "goertzel_set_orders", cmd_goertzel_set_orders },
    { CMD_GOERTZEL_START,      "goertzel_start",      cmd_goertzel_start      },
    { CMD_GOERTZEL_STATUS,     "goertzel_status",     cmd_goertzel_status     },
    { CMD_GOERTZEL_READ,       "goertzel_read",       cmd_goertzel_read       },
    { CMD_GOERTZEL_STOP,       "goertzel_stop",       cmd_goertzel_stop       },
    { CMD_GOERTZEL_INJECT_RPM, "goertzel_inject_rpm", cmd_goertzel_inject_rpm },
    { CMD_SET_MOTOR_MODE,     "set_motor_mode",     cmd_set_motor_mode     },
    { CMD_SET_DSP_MODE,       "set_dsp_mode",       cmd_set_dsp_mode       },
    { CMD_GET_STATUS,         "get_status",         cmd_get_status         },
    { CMD_MOTOR_DRIVE,        "motor_drive",        cmd_motor_drive        },
    { CMD_DAC_PROBE,          "dac_probe",          cmd_dac_probe          },
    { CMD_ENCODER_READ,       "encoder_read",       cmd_encoder_read       },
    { CMD_ENCODER_RESET,      "encoder_reset",      cmd_encoder_reset      },
    { CMD_MOTOR_CONFIG,       "motor_config",       cmd_motor_config       },
    { CMD_PWM_TEST,           "pwm_test",           cmd_pwm_test           },
    { CMD_DAC_CONST,          "dac_const",          cmd_dac_const          },
    { CMD_DAC_SQUARE,         "dac_square",         cmd_dac_square         },
    { CMD_STREAMS_READ,       "streams_read",       cmd_streams_read       },
    { CMD_ENCODER_STIM,       "encoder_stim",       cmd_encoder_stim       },
    { CMD_RS485_STATS,        "rs485_stats",        cmd_rs485_stats        },
};

const shell_cmd_entry_t* chip_commands_table(void)
{
    return g_chip_commands;
}

uint8_t chip_commands_count(void)
{
    return (uint8_t)(sizeof(g_chip_commands) / sizeof(g_chip_commands[0]));
}
